* Sprint 1
|                                           | Note | Nicholson | Teddy | Cristina | Rami | Commentaires |
| Qualité du prototype d'interface :        | A    |           |       |          |      |              |
|                                           |      |           |       |          |      |              |
| Présentation :                            | A    |           |       |          |      |              |
|                                           |      |           |       |          |      |              |
| Évaluation du travail par les pairs (50%) | ×    | A         | A     | A        | A    |              |
| Participation à la présentation     (50%) | ×    | A         | A     | A        | A    |              |
|-------------------------------------------+------+-----------+-------+----------+------+--------------|
| Total                                     |      | 10        | 10    | 10       | 10   |              |

* Sprint 2
|                                           | Note | Rami | Cristina | Nicholson | Teddy                |
| Qualité du produit :                      | A    |      |          |           |                      |
|                                           |      |      |          |           |                      |
| Présentation :                            | A    |      |          |           |                      |
|                                           |      |      |          |           |                      |
| Évaluation du travail par les pairs (33%) | ×    | A    | A        | A         | E - Pas d'évaluation |
| Participation à la présentation     (33%) | ×    | A    | A        | A         | A                    |
| Participation au développement      (33%) | ×    | A    | A        | A         | A                    |
|-------------------------------------------+------+------+----------+-----------+----------------------|
| Total                                     |      | 10   | 10       | 10        | 6.7                  |

* Sprint 3
|                                           | Note | Cristina | Nicholson | Teddy                | Rami | Commentaires |
| Qualité du produit :                      | A    |          |           |                      |      |              |
|                                           |      |          |           |                      |      |              |
| Présentation :                            | A    |          |           |                      |      |              |
|                                           |      |          |           |                      |      |              |
| Évaluation du travail par les pairs (33%) | ×    | A        | A         | E - Pas d'évaluation | A    |              |
| Participation à la présentation     (33%) | ×    | A        | A         | A                    | A    |              |
| Participation au développement      (33%) | ×    | A        | A         | A                    | A    |              |
|-------------------------------------------+------+----------+-----------+----------------------+------+--------------|
| Total                                     |      | 10       | 10        | 6.7                  | 10   |              |

* Sprint 4
|                                           | Note | Nicholson | Cristina             | Teddy | Rami | Commentaires |
| Qualité du produit :                      | A    |           |                      |       |      |              |
|                                           |      |           |                      |       |      |              |
| Présentation :                            | A    |           |                      |       |      |              |
|                                           |      |           |                      |       |      |              |
| Évaluation du travail par les pairs (33%) | ×    | A         | E - pas d'évaluation | A     | A    |              |
| Participation à la présentation     (33%) | ×    | A         | A                    | A     | A    |              |
| Participation au développement      (33%) | ×    | A         | A                    | A     | A    |              |
|-------------------------------------------+------+-----------+----------------------+-------+------+--------------|
| Total                                     |      | 10        | 6.7                  | 10    | 10   |              |

* Livraison finale
|                                                                                                                    |             |            |      |                                                                                                                                                                             |                 Nicholson |                  Cristina |                     Teddy |                      Rami |
|                                                                                                                    | Pondération | Évaluation | Note | Commentaires                                                                                                                                                                | Participation personnelle | Participation personnelle | Participation personnelle | Participation personnelle |
|--------------------------------------------------------------------------------------------------------------------+-------------+------------+------+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------+---------------------------+---------------------------+---------------------------+---------------------------|
| Programmation correcte des fonctionnalités de l’application                                                        |             |            |      |                                                                                                                                                                             |                           |                           |                           |                           |
| - Séparation des responsabilités                                                                                   |          15 | B          | 12.0 | Vos services ne font rien; la logique d'affaire est dans les présentateurs. Il reste quelques traitements dans les vues et quelques données qui ne sont pas dans le modèle. |                           |                           |                           |                           |
| - Dépendances unidirectionnelles                                                                                   |          10 | A          | 10.0 |                                                                                                                                                                             |                           |                           |                           |                           |
|--------------------------------------------------------------------------------------------------------------------+-------------+------------+------+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------+---------------------------+---------------------------+---------------------------+---------------------------|
| Conception correcte des interfaces graphiques                                                                      |             |            |      |                                                                                                                                                                             |                           |                           |                           |                           |
| - Respecte les principes d'ergonomie                                                                               |          10 | A          | 10.0 |                                                                                                                                                                             |                           |                           |                           |                           |
| - Internationalisation                                                                                             |           5 | A          |  5.0 |                                                                                                                                                                             |                           |                           |                           |                           |
|--------------------------------------------------------------------------------------------------------------------+-------------+------------+------+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------+---------------------------+---------------------------+---------------------------+---------------------------|
| Programmation judicieuse des interactions avec l’utilisateur                                                       |             |            |      |                                                                                                                                                                             |                           |                           |                           |                           |
| - Robustesse                                                                                                       |           5 | A          |  5.0 |                                                                                                                                                                             |                           |                           |                           |                           |
| - Utilisation de fils d'exécution                                                                                  |          10 | A          | 10.0 |                                                                                                                                                                             |                           |                           |                           |                           |
|--------------------------------------------------------------------------------------------------------------------+-------------+------------+------+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------+---------------------------+---------------------------+---------------------------+---------------------------|
| Programmation judicieuse des interactions avec l’environnement (capteurs, logiciels, données internes et externes) |             |            |      |                                                                                                                                                                             |                           |                           |                           |                           |
| - Passage de données à une application tierce                                                                      |           5 | A          |  5.0 |                                                                                                                                                                             |                           |                           |                           |                           |
| - Gestion des cas d'erreur                                                                                         |           5 | A          |  5.0 |                                                                                                                                                                             |                           |                           |                           |                           |
|--------------------------------------------------------------------------------------------------------------------+-------------+------------+------+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------+---------------------------+---------------------------+---------------------------+---------------------------|
| Utilisation adéquate des mécanismes de collaboration en équipe                                                     |             |            |      |                                                                                                                                                                             |                           |                           |                           |                           |
| - Utilisation de branches et commits                                                                               |           5 | A          |  5.0 |                                                                                                                                                                             |                           |                           |                           |                           |
| - Documentation des commits                                                                                        |           5 | A          |  5.0 |                                                                                                                                                                             |                           |                           |                           |                           |
|--------------------------------------------------------------------------------------------------------------------+-------------+------------+------+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------+---------------------------+---------------------------+---------------------------+---------------------------|
| Pertinence et clarté de la documentation                                                                           |             |            |      |                                                                                                                                                                             |                           |                           |                           |                           |
| - Clarté du code                                                                                                   |           5 | A          |  5.0 |                                                                                                                                                                             |                           |                           |                           |                           |
| - Nomenclature (fonctions, variables, classes)                                                                     |           5 | A          |  5.0 |                                                                                                                                                                             |                           |                           |                           |                           |
|--------------------------------------------------------------------------------------------------------------------+-------------+------------+------+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------+---------------------------+---------------------------+---------------------------+---------------------------|
| Validation judicieuse de l’application à l’aide de tests                                                           |             |            |      |                                                                                                                                                                             |                           |                           |                           |                           |
| - Tests unitaires du domaine (entités, services)                                                                   |          10 | D          |  4.0 |                                                                                                                                                                             |                           |                           |                           |                           |
| - Tests unitaires de la couche présentation (présentateurs)                                                        |           5 | E          |  0.0 |                                                                                                                                                                             |                           |                           |                           |                           |
|--------------------------------------------------------------------------------------------------------------------+-------------+------------+------+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------+---------------------------+---------------------------+---------------------------+---------------------------|
| Qualité du français                                                                                                |  (max -10%) | B          | -2.0 | Certains commentaires sont en franglais qui font mal aux yeux.                                                                                                              |                           |                           |                           |                           |
|--------------------------------------------------------------------------------------------------------------------+-------------+------------+------+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------+---------------------------+---------------------------+---------------------------+---------------------------|
| Sous-Total                                                                                                         |             |            |  84. |                                                                                                                                                                             |                           |                           |                           |                           |
|--------------------------------------------------------------------------------------------------------------------+-------------+------------+------+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------+---------------------------+---------------------------+---------------------------+---------------------------|
| Participation personnelle                                                                                          |        100% |            |    × |                                                                                                                                                                             |                       100 |                       100 |                        90 |                       100 |
|--------------------------------------------------------------------------------------------------------------------+-------------+------------+------+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------+---------------------------+---------------------------+---------------------------+---------------------------|
| Total                                                                                                              |             |            |      |                                                                                                                                                                             |                      84.0 |                      84.0 |                      75.0 |                      84.0 |
#+TBLFM: @3$4..@23$4='(if (string= "" $2) "" (format "%2.1f" (* (string-to-number $2) (if (string= $3 "E") 0 (/ (+ (- 70 (aref $3 0)) (cond ((= (aref (substring $3 -1) 0) ?+) 0.33) ((= (aref (substring $3 -1) 0) ?-) -0.33) (t 0))) 5.0)))))'::@24$4='(format "-%2.1f" (+ 10 (* -10 (/ (+ (- 70 (aref $3 0)) (cond ((= (aref (substring $3 -1) 0) ?+) 0.33) ((= (aref (substring $3 -1) 0) ?-) -0.33) (t 0))) 5.0))))'::@25$4=vsum(@3..@24)::@27$6='(format "%2.1f" (/ (* (string-to-number @25$4) (string-to-number @26$6)) 100))'::@27$7='(format "%2.1f" (/ (* (string-to-number @25$4) (string-to-number @26$7)) 100))'::@27$8='(format "%2.1f" (/ (* (string-to-number @25$4) (string-to-number @26$8)) 100))'::@27$9='(format "%2.1f" (/ (* (string-to-number @25$4) (string-to-number @26$9)) 100))'

